; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_4 ?v7 - type_1 ?v8 - type_2)
 	      (pred_3 ?v3 - object ?v8 - type_2)
	      (pred_1 ?v7 - type_1 ?v4 - type_3)
	      (pred_2 ?v7 - type_1 ?v3 - object ?v4 - type_3))

   (:action op_2
       :parameters  (?v7 - type_1 ?v6 ?v5 - type_2)
       :precondition (and  (pred_4 ?v7 ?v6))
       :effect (and  (pred_4 ?v7 ?v5)
		     (not (pred_4 ?v7 ?v6))))

   (:action op_3
       :parameters (?v7 - type_1 ?v1 - object ?v2 - type_2 ?v4 - type_3)
       :precondition  (and  (pred_3 ?v1 ?v2) (pred_4 ?v7 ?v2) (pred_1 ?v7 ?v4))
       :effect (and (pred_2 ?v7 ?v1 ?v4)
		    (not (pred_3 ?v1 ?v2)) 
		    (not (pred_1 ?v7 ?v4))))

   (:action op_1
       :parameters (?v7 - type_1 ?v1 - object ?v2 - type_2 ?v4 - type_3)
       :precondition  (and  (pred_2 ?v7 ?v1 ?v4) (pred_4 ?v7 ?v2))
       :effect (and (pred_3 ?v1 ?v2)
		    (pred_1 ?v7 ?v4)
		    (not (pred_2 ?v7 ?v1 ?v4)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_08 obj_01 - type_1
obj_09 obj_02 obj_06 obj_07 - type_3
obj_05 obj_12 obj_11 obj_04 - type_2
obj_10 obj_13 obj_03 - object)
(:init
(pred_4 obj_08 obj_05)
(pred_1 obj_08 obj_09)
(pred_1 obj_08 obj_02)
(pred_4 obj_01 obj_05)
(pred_1 obj_01 obj_06)
(pred_1 obj_01 obj_07)
(pred_3 obj_10 obj_05)
(pred_3 obj_13 obj_11)
(pred_3 obj_03 obj_05)
)
(:goal
(and
(pred_3 obj_10 obj_11)
(pred_3 obj_13 obj_04)
(pred_3 obj_03 obj_05)
)
)

(:constraints
  (always (not (pred_4 obj_08 obj_11)))
)
)

; plan
1. (op_3 obj_08 obj_10 obj_05 obj_02)
   deleted: (pred_3 obj_10 obj_05) (pred_1 obj_08 obj_02)
   added: (pred_2 obj_08 obj_10 obj_02)
   goals met: 1 of 3
2. (op_2 obj_01 obj_05 obj_11)
   deleted: (pred_4 obj_01 obj_05)
   added: (pred_4 obj_01 obj_11)
   goals met: 1 of 3
3. (op_3 obj_01 obj_13 obj_11 obj_07)
   deleted: (pred_3 obj_13 obj_11) (pred_1 obj_01 obj_07)
   added: (pred_2 obj_01 obj_13 obj_07)
   goals met: 1 of 3
4. (op_2 obj_08 obj_05 obj_04)
   deleted: (pred_4 obj_08 obj_05)
   added: (pred_4 obj_08 obj_04)
   goals met: 1 of 3
5. (op_2 obj_01 obj_11 obj_04)
   deleted: (pred_4 obj_01 obj_11)
   added: (pred_4 obj_01 obj_04)
   goals met: 1 of 3
6. (op_1 obj_08 obj_10 obj_04 obj_02)
   deleted: (pred_2 obj_08 obj_10 obj_02)
   added: (pred_3 obj_10 obj_04) (pred_1 obj_08 obj_02)
   goals met: 1 of 3
7. (op_1 obj_01 obj_13 obj_04 obj_07)
   deleted: (pred_2 obj_01 obj_13 obj_07)
   added: (pred_3 obj_13 obj_04) (pred_1 obj_01 obj_07)
   goals met: 2 of 3
8. (op_3 obj_01 obj_10 obj_04 obj_07)
   deleted: (pred_3 obj_10 obj_04) (pred_1 obj_01 obj_07)
   added: (pred_2 obj_01 obj_10 obj_07)
   goals met: 2 of 3
9. (op_2 obj_01 obj_04 obj_11)
   deleted: (pred_4 obj_01 obj_04)
   added: (pred_4 obj_01 obj_11)
   goals met: 2 of 3
10. (op_1 obj_01 obj_10 obj_11 obj_07)
   deleted: (pred_2 obj_01 obj_10 obj_07)
   added: (pred_3 obj_10 obj_11) (pred_1 obj_01 obj_07)
   goals met: 3 of 3
